package dop.chapter08;

public class Listing8_55 {
    /**
     * ───────────────────────────────────────────────────────
     * Listing 8.55
     * ───────────────────────────────────────────────────────
     * Easy to generate, but not exactly easy to read
     * ───────────────────────────────────────────────────────
     */
    /*
    ┌───────────────────OUTPUT───────────────────────┐
    (((COUNTRY = US or COUNTRY = BE) or COUNTRY = FR)     So many parentheses! What is this -- Lisp!?
     and (SEGMENT = public or not (REGION = LATAM)))


    */
}
